4-9 Tasks Part 1

01 import libraries and datasets

In [3]:
#01.1 import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [4]:
#01.2 create path to project folder
path=r'D:\Joan\CareerFoundry\Assessment 4\2024-08-Instacart Basket Analysis'

In [5]:
#01.3 import dataframe customers
df_cust=pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

02 initial description of original dataset

In [7]:
#02.1 shape of df_cust and record on project spreadsheet
df_cust.shape

(206209, 10)

In [8]:
#02.2 see columns of df_cust
df_cust.columns

Index(['user_id', 'First Name', 'Surnam', 'Gender', 'STATE', 'Age',
       'date_joined', 'n_dependants', 'fam_status', 'income'],
      dtype='object')

In [9]:
#02.3 first five rows of df_cust
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [10]:
#02.4 info on df_cust
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [11]:
#02.5 describe df_cust
df_cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [12]:
#02.6 look for missing data in df_cust
df_cust.isnull().sum()

user_id             0
First Name      11259
Surnam              0
Gender              0
STATE               0
Age                 0
date_joined         0
n_dependants        0
fam_status          0
income              0
dtype: int64

03 Wrangling Data: Dropping Columns, Renaming, Changing Data Type, and Transposition

In [14]:
#03.1 Dropping columns - I see no unnecessary columns so none will be dropped.

In [15]:
#03.2 Renaming columns - Surnam, STATE, n_dependents, fam status

In [16]:
#03.21 Surnam to Last Name
df_cust.rename(columns={'Surnam' : 'Last Name'}, inplace=True)

In [17]:
#03.22 STATE to state
df_cust.rename(columns={'STATE' : 'state'}, inplace=True)

In [18]:
#03.23 n_dependants to number_of_dependents
df_cust.rename(columns={'n_dependants' : 'number_of_dependents'}, inplace=True)

In [19]:
#03.24 fam status to marital_status
df_cust.rename(columns={'fam_status' : 'marital_status'}, inplace=True)

In [20]:
#03.25 First Name to first_name
df_cust.rename(columns={'First Name' : 'first_name'}, inplace=True)

In [21]:
#03.26 Age to age
df_cust.rename(columns={'Age' : 'age'}, inplace=True)

In [22]:
#03.27 Gender to sex
df_cust.rename(columns={'Gender' : 'sex'}, inplace=True)

In [23]:
#03.21 Last Name to last_name
df_cust.rename(columns={'Last Name' : 'last_name'}, inplace=True)

In [24]:
#03.25 check renaming of columns
df_cust.columns

Index(['user_id', 'first_name', 'last_name', 'sex', 'state', 'age',
       'date_joined', 'number_of_dependents', 'marital_status', 'income'],
      dtype='object')

In [25]:
#03.3 Changing Data Types - user_id, date_joined

In [26]:
#03.31 change user_id from int64 to object
df_cust['user_id']=df_cust['user_id'].astype('str')

In [27]:
#03.32 change date_joined from object to datetime set time format
timefmt = "%m/%d/%Y"

In [28]:
#03.33 change date_joined from object to datetime
df_cust['date_joined'] = pd.to_datetime(df_cust['date_joined'], format = timefmt, errors='coerce')

In [29]:
#03.34 check first five rows of df_cust
df_cust.head()

,user_id,first_name,last_name,sex,state,age,date_joined,number_of_dependents,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,2017-01-01,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,2017-01-01,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,2017-01-01,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,2017-01-01,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,2017-01-01,1,married,40374

In [30]:
#03.35 check df_cust datatypes
df_cust.dtypes

user_id                         object
first_name                      object
last_name                       object
sex                             object
state                           object
age                              int64
date_joined             datetime64[ns]
number_of_dependents             int64
marital_status                  object
income                           int64
dtype: object

04 Categorical Data Review

In [32]:
#04.1 frequency of gender
df_cust['sex'].value_counts()

sex
Male      104067
Female    102142
Name: count, dtype: int64

In [33]:
#04.2 frequency of State
df_cust['state'].value_counts()

state
Florida                 4044
Colorado                4044
Illinois                4044
Alabama                 4044
District of Columbia    4044
Hawaii                  4044
Arizona                 4044
Connecticut             4044
California              4044
Indiana                 4044
Arkansas                4044
Alaska                  4044
Delaware                4044
Iowa                    4044
Idaho                   4044
Georgia                 4044
Wyoming                 4043
Mississippi             4043
Oklahoma                4043
Utah                    4043
New Hampshire           4043
Kentucky                4043
Maryland                4043
Rhode Island            4043
Massachusetts           4043
Michigan                4043
New Jersey              4043
Kansas                  4043
South Dakota            4043
Minnesota               4043
Tennessee               4043
New York                4043
Washington              4043
Louisiana               4043
Montana                 4043
North Dakota            4043
Wisconsin               4043
Nebraska                4043
Vermont                 4043
Nevada                  4043
Maine                   4043
North Carolina          4043
West Virginia           4043
Virginia                4043
Oregon                  4043
New Mexico              4043
Texas                   4043
Pennsylvania            4043
Ohio                    4043
South Carolina          4043
Missouri                4043
Name: count, dtype: int64

In [34]:
#04.3 frequency of marital_status
df_cust['marital_status'].value_counts()

marital_status
married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: count, dtype: int64

05 Check for Missing Values

In [36]:
#05.1 check for missing values all
df_cust.isnull().sum()

user_id                     0
first_name              11259
last_name                   0
sex                         0
state                       0
age                         0
date_joined                 0
number_of_dependents        0
marital_status              0
income                      0
dtype: int64

In [37]:
#05.2 create subset to look at missing first names
df_first_name=df_cust[df_cust['first_name'].isnull()==True]

In [38]:
#05.3 see first 5 rows of df_first_name
df_first_name.head()

,user_id,first_name,last_name,sex,state,age,date_joined,number_of_dependents,marital_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,2017-01-01,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,2017-01-01,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,2017-01-01,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,2017-01-01,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,2017-01-01,3,married,151819

06 Check for Duplicates

In [40]:
#06.1 check for duplicates across first name, last name, state, gender, age by creating subset
print(df_cust.duplicated(subset=['first_name', 'last_name', 'state', 'sex', 'age']))

0         False
1         False
2         False
3         False
4         False
          ...
206204    False
206205    False
206206    False
206207    False
206208    False
Length: 206209, dtype: bool

In [41]:
#06.2 Count of duplicates
print(df_cust.duplicated().sum())

0

In [42]:
#06.3 Look for duplicates in df_cust by last name, gender, age
print(df_cust.duplicated(subset=['last_name', 'sex', 'age']))

0         False
1         False
2         False
3         False
4         False
          ...
206204     True
206205     True
206206     True
206207     True
206208     True
Length: 206209, dtype: bool

In [43]:
#06.4 Count of duplicates
print(df_cust.duplicated().sum())

0

In [44]:
#06.5 frequency of duplicates
print(df_cust.duplicated().value_counts())

False    206209
Name: count, dtype: int64

In [45]:
#06.6 duplicate user_id check
print(df_cust.duplicated(subset=['user_id']))

0         False
1         False
2         False
3         False
4         False
          ...
206204    False
206205    False
206206    False
206207    False
206208    False
Length: 206209, dtype: bool

In [46]:
#06.7 check frequency user_id duplicates
print(df_cust.duplicated().value_counts())

False    206209
Name: count, dtype: int64

07 Check for mix data types

In [48]:
#07.1 check for mixed type data
for col in df_cust.columns.tolist():
    weird = (df_cust[[col]].map(type) !=df_cust[[col]].iloc[0].apply(type)).any(axis=1)
    if len (df_cust[weird]) > 0:
        print (col)

first_name

In [49]:
#07.2 I don't think I even need this column because I have user_id but I don't want to delete just in case it is needed as an identification tool. 
#07.3 I don't think it matters that First Name is mixed data because the mixed values are the missing values

In [50]:
#07.4 
df_cust['first_name'].dtypes

dtype('O')

In [51]:
#07.5 check shape after cleaning
df_cust.shape

(206209, 10)

In [52]:
#07.6 
df_cust['user_id'].dtypes

dtype('O')

08 Import data for merge

In [54]:
#08.1 import ords_prods_merge_48.pkl
df_op_merge=pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'op_merged_new.pkl'))

In [55]:
#08.2
df_op_merge['user_id'].dtypes

dtype('int64')

In [56]:
#08.3
df_op_merge['user_id']=df_op_merge['user_id'].astype('str')

In [57]:
#08.4
df_op_merge['user_id'].dtypes

dtype('O')

In [58]:
#08.5 data types
df_op_merge.dtypes

order_id                           int64
user_id                           object
order_number                       int64
orders_day_of_week                 int64
order_hour_of_day                  int64
days_since_prior_order           float64
product_id                         int64
product_name                      object
department_id                    float64
prices                           float64
price_range_loc                   object
busiest_day                       object
busiest_days                      object
busiest_period_of_day             object
max_order                          int64
loyalty_flag                      object
spending_flag                     object
average_price                    float64
median_days_since_prior_order    float64
frequency_flag                    object
dtype: object

In [59]:
#08.5 merge data 
df_orders_products_all=df_cust.merge(df_op_merge, on=['user_id'], how='outer')

In [60]:
#08.6 show shape of new file
df_orders_products_all.shape

(32435059, 29)

In [61]:
#08.7 export pickle file
df_orders_products_all.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_all.pkl'))